Управление_пожарной_частью_/src/Documents/СдачаНормативов/СдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаНормативов</name>
  <basedOn>Document.ПланСдачиНормативов</basedOn>
  <registerRecords>InformationRegister.РезультатВыполненияУпражнений</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СдачаНормативов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура НормативыРезультатПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.Нормативы.ТекущиеДанные;
	 
	Если ТекущаяСтрока.Сотрудник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.Норматив = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Результат) Тогда
		ТекущаяСтрока.Оценка = "Не выполнил";
		Элементы.Нормативы.Обновить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Оценка = РассчитатьОценкуНаСервере
		(ТекущаяСтрока.Сотрудник,
		ТекущаяСтрока.Норматив, 
		ТекущаяСтрока.Результат);
		ТекущаяСтрока.Оценка = Оценка;
		
	Исключение
		ТекущаяСтрока.Оценка = "Ошибка";
	КонецПопытки;
	
	Элементы.Нормативы.Обновить();
КонецПроцедуры
&НаСервере
Функция РассчитатьОценкуНаСервере(Сотрудник, Норматив, Результат)
	
	Попытка
		Возврат УправлениеНормативами.РассчитатьОценкуПоСотруднику
			(Сотрудник,
			Норматив,
			Результат,
			Объект.Дата);
	Исключение
		Возврат "Ошибка";
	КонецПопытки;
	
КонецФункции
